/*
 * xi (aka ξ), a search tool for the Unicode Character Database.
 *
 * Copyright (c) 2020 Michael Clark <michaeljclark@mac.com>
 *
 * Permission to use, copy, modify, and distribute this software for any
 * purpose with or without fee is hereby granted, provided that the above
 * copyright notice and this permission notice appear in all copies.
 *
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
 * ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
 * ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
 * OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 */

#include <cstdio>
#include <cstdint>
#include <cstdlib>
#include <cstring>
#include <cerrno>
#include <cctype>
#include <cinttypes>

#include <map>
#include <set>
#include <chrono>
#include <vector>
#include <string>
#include <utility>
#include <algorithm>

#include "utf8.h"
#include "hashmap.h"
#include "stdendian.h"
#include "xi_nub.h"
#include "xi_common.h"

/*
 * xi (aka ξ), a search tool for the Unicode Character Database.
 */

using namespace std::chrono;

using string = std::string;
template <typename T> using vector = std::vector<T>;
template <typename K,typename V> using pair = std::pair<K,V>;
template <typename K,typename V> using map = std::map<K,V>;

bool _debug_enabled;

static const char* unicode_data_file = "data/14.0.0/UnicodeData.txt";
static bool help_text = false;
static bool standalone_search = false;
static bool nub_server = false;
static bool timings_enabled = false;
static bool optimized_search = true;
static vector<string> unicode_search_terms;
static string unicode_numeric_term;

/*
 * schema for UnicodeData.txt from Unicode Character Database (UCD.zip)
 */

struct unicode_data {
    /*  0 */ uint32_t Code;
    /*  1 */ string Name;
    /*  2 */ string General_Category;
    /*  3 */ string Canonical_Combining_Class;
    /*  4 */ string Bidi_Class;
    /*  5 */ string Decomposition_Type;
    /*  6 */ string Decomposition_Mapping;
    /*  7 */ string Numeric_Type;
    /*  8 */ string Numeric_Value;
    /*  9 */ string Bidi_Mirrored;
    /* 10 */ string Unicode_1_Name;
    /* 11 */ string ISO_Comment;
    /* 12 */ string Simple_Uppercase_Mapping;
    /* 13 */ string Simple_Lowercase_Mapping;
    /* 14 */ string Simple_Titlecase_Mapping;
};

/*
 * utilities for reading the unicode character database
 */

enum split_flags { none = 0x0, inc_sep = 0x1, inc_empty = 0x2 };

static vector<string> split(string str, string sep, split_flags flags = none)
{
    size_t i, j = 0;
    vector<string> comps;
    const bool inc_sep = flags & split_flags::inc_sep;
    const bool inc_empty = flags & split_flags::inc_empty;
    while ((i = str.find_first_of(sep, j)) != string::npos) {
        if ((inc_empty) || i - j > 0) comps.push_back(str.substr(j, i - j));
        if ((inc_sep)) comps.push_back(str.substr(i, sep.size()));
        j = i + sep.size();
    }
    if (inc_empty || str.size() - j > 0) {
        comps.push_back(str.substr(j, str.size() - j));
    }
    return comps;
}

static string join(vector<string> comps, string sep, size_t start, size_t end)
{
    string str;
    for (size_t i = start; i != end; i++) {
        if (i != start) {
            str.append(sep);
        }
